
import Carousel from 'react-bootstrap/Carousel';
import section1 from '../../src/section1.png'
import { connect } from 'react-redux'
import { Redirect } from "react-router-dom";
import title from '../../src/title.png'

const Tips = ({ auth }) => {
    if (!auth) return <Redirect to='/' />
    return (
        <div >
            <div className='container' style={{ marginTop: "6%", direction: 'rtl' }}  >
                <div className="card" style={{ margin: 'auto', height: 'auto', width: "auto" }}>
                    <img src={title} class="card-img-top" alt="contactImage" style={{ height: "250px", width: "500px", margin: "auto", backgroundColor: "yellow," }} />
                    <div class="card-body card-text" style={{ color: 'white' }}>
                        <h1>10 טיפים לאימון כושר יעיל!</h1>
                        <h2>1.מתחילים להתאמן היום, לא מחר</h2>
                        <p>אתם רוצים לעשות שינוי ולסגל לעצמכם הרגלים בריאים (קל וחומר שבתקופת הקורונה?). התחילו להתאמן היום, לא מחר!</p>
                        <h2>2.הגדרת מטרות: איפה תרצו להיות בעוד כחצי שנה?</h2>
                        <p> לפני שאתם מרימים את המשקולת הראשונה או יוצאים לרוץ, דעו מהן המטרות שלכם. מבלי שישנה מטרה ברורה מול העיניים, יהיה לכם קשה מאד להתמיד. המטרה יכולה להיות חיזוק ועיצוב, שריפת שומנים, הפגת מתחים ועוד.</p>
                        <h2>3.יום קבוע, שעה קבועה – רק כך מתמידים</h2>
                        <p>אז איך הופכים כל אימון ליעיל? בין היתר, עם תחימתו במסגרת קבועה וידועה מראש. המטרה היא לשלב את האימונים בצורה אורגנית באורח חייכם, מבלי שתרגישו שאתם מתאמצים והופכים עולמות בשביל למצוא זמן לאימון. לכן, מומלץ מאד לקבוע מראש ימים ושעות לאימונים. לדוגמא: ימים ראשון, שלישי וחמישי בשעה 19.00 – אימון!</p>
                        <h2>4.בגדים נוחים, נעליים נוחות</h2>
                        <p>אימון יעיל נשען בין היתר על מידת הנוחות שלכם. אל תתפשרו על נעליים המתאימות לסוג האימון (לדוגמא: נעלי ריצה), והעניק חשיבות עליונה לבגדים, עם עדיפות לחולצות מנדפות זיעה. אתם רק יכולים לדמיין עד כמה היעילות שלכם תיפגע במידה ולא יהיה לכם נוח…

                            באתר שלנו תוכלו להתרשם ממגוון פריטים נוחים לאימונים יעילים: מכנסי לחימה, טייצים לנשים ולגברים, חולצות אימון, כובעים ועוד.</p>
                        <h2>5.השתדלו שלא לבטל אימונים</h2>
                        <p>מובן כי ישנם אילוצים, אירועי SOS ופנצ’רים שלא משאירים לכם ברירה, אלא לבטל את האימון. עם זאת, השתדלו שלא לבטל אימונים, אלא רק לדחות אותם – בשעה או ביום. המטרה היא לשמור על רצף ועקביות שתורמים גם לחיזוק הגוף וגם לשמירה על המוטיבציה שלכם.</p>
                        <h2>6.עשו את זה באהבה, או שאל תעשו בכלל</h2>
                        <p>האימונים אמורים להעניק לכם שחרור, הנאה וסיפוק. אין כל תכלית באימונים שלא מאתגרים, משמחים וגורמים לכם להנאה. ניסיתם להתאמן ברצועות TRX ופחות התחברתם? התאמנו באימוני כוח מסוג אחר. אתם לא אוהבים לרוץ? נסו אליפטיקל או אופני ספינינג.</p>                        <h2>3.יום קבוע, שעה קבועה – רק כך מתמידים</h2>
                        <p>אז איך הופכים כל אימון ליעיל? בין היתר, עם תחימתו במסגרת קבועה וידועה מראש. המטרה היא לשלב את האימונים בצורה אורגנית באורח חייכם, מבלי שתרגישו שאתם מתאמצים והופכים עולמות בשביל למצוא זמן לאימון. לכן, מומלץ מאד לקבוע מראש ימים ושעות לאימונים. לדוגמא: ימים ראשון, שלישי וחמישי בשעה 19.00 – אימון!</p>
                        <h2>7.מנוחה היא חלק מהעניין</h2>
                        <p>הגדרתם לעצמכם מטרה ואין בכוונתם לנוח בכדי שתוכלו לכבוש אותה כמה שיותר מהר? טעות. למעשה, מנוחה חשובה כמעט כמו האימונים. הימים שבהם אתם לא מתאמנים, אלא נחים, מאפשרים לשרירים להשתקם, להיבנות ולהסתגל לתוכנית האימונים.</p>
                        <h2>8.אכלו לפני ואחרי האימון</h2>
                        <p>מתאמנים יקרים, אתם רוצים ליהנות מאימונים יעילים? אתם צריכים לאכול! אכילה לפני האימון מספקת לכם אנרגיה זמינה, המבססת את התנאי הבסיסי ביותר לאימון יעיל. לאחר האימון בו “בזבזתם” את כל האנרגיה שהכנסתם, אתם נדרשים להשיב אותה לגופכם בחזרה – הארוחה שאחרי האימון.</p>
                        <p>טיפ מאיתנו: במידה ואתם מתאמנים באימוני כוח, שלבו בתפריט שלכם (בהתאם להמלצת תזונאית הספורט) גם חטיפי חלבון, אבקות חלבון, גיינרים ועוד. את מגוון התוספים תוכלו לרכוש אצלנו באתר!</p>
                        <h2>9.התאמנו בזוג או בקבוצה</h2>
                        <p>קל יותר להתמסר, ליהנות ולהתחייב לתוכנית האימונים כשאתם לא מתאמנים לבד. פתוחות בפניכם אינספור אפשרויות: אימונים עם קבוצת מתאמנים בפארק, הצטרפות לתוכנית אימונים המועברת בזום, אימון עם מאמן כושר אישי, חוגים בסטודיו והרשימה עוד ארוכה.</p>
                        <h2>10.הרימו לעצמכם, אתם ראויים!</h2>
                        <p>אתם חוגגים הישג מרשים? התוצאות משתקפות מול המראה ומעלות חיוך על פניכם? חגגו את ההצלחות שלכם ושתפו בהן את הקרובים אליכם. החיזוקים החיוביים שתקבלו מהסביבה יעודדו אתכם להתמיד באורח החיים הבריא, המעצים והמספק!</p>
                    </div>
                    <div class="card-body">
                    </div>
                </div>
            </div>
            <div style={{ backgroundColor: "white", marginTop: "10%" }}>

            </div>
        </div>
    )
}
const mapStateToProps = (state) => {
    return {
        auth: state.firebase.auth.uid,
    }
}
export default
    connect(mapStateToProps)(Tips)
